# 1. კონსოლიდან შეიტანეთ ორი რიცხვი და დაბეჭდეთ ყველა არითმეტიკული ოპერაცია (მიმატება, გამოკლება, გამრავლება, ჩვეულებრივი გაყოფა, მთელზე გაყოფა, ნაშთის აღება, ახარისხება).

# კონსოლიდან ორი რიცხვის შეტანა
x = int(input("x = "))
y = int(input("y = "))

# არითმეტიკული ოპერაციები
print("x + y =", x + y)    # მიმატება
print("x - y =", x - y)    # გამოკლება
print("x * y =", x * y)    # გამრავლება
print("x / y =", x / y)    # ჩვეულებრივი გაყოფა
print("x // y =", x // y)  # მთელზე გაყოფა
print("x % y =", x % y)    # ნაშთის აღება
print("x ** y =", x ** y)  # ახარისხება



# 2. დაწერეთ პროგრამა რომბის ფართობის გამოსათვლელად. მომხმარებელს კლავიატურის გამოყენებით შეაქვს ორი დიაგონალის სიგრძე.

# ორი დიაგონალის სიგრძის შეტანა
d1 = float(input("d1 = "))
d2 = float(input("d1 = "))

# ფართობის გამოთვლა
area = (d1 * d2) / 2

print(f"რომბის ფართობი: {area}")



# 3. მომხმარებელის შეაქვს მეტრების რაოდენობა. დაბეჭდეთ შესაბამისი მნიშვნელობა სანტიმეტრებში, დეციმეტრებში, მილიმეტრებში, მილში.

# მეტრების შეტანა
meters = float(input("შეიყვანეთ მეტრების რაოდენობა: "))

# გადაყვანა სხვადასხვა ერთეულებში
centimeters = meters * 100    # 1 მ = 100 სმ
decimeters = meters * 10      # 1 მ = 10 დმ
millimeters = meters * 1000   # 1 მ = 1000 მმ
miles = meters * 0.00062137   # 1 მილი = 1609.344 მ

# შედეგების გამოტანა
print(f"{meters} მეტრი არის:")
print(f"- {centimeters} სანტიმეტრი")
print(f"- {decimeters} დეციმეტრი")
print(f"- {millimeters} მილიმეტრი")
print(f"- {miles} მილი")



# 4. დაწერეთ პროგრამა, რომელიც ითვლის სამკუთხედის ფართობს. მომხმარებელს კონსოლიდან შეყავს სამკუთხედის სიმაღლისა და ფუძის მნიშვნელობა.

# ფუძისა და სიმაღლის შეტანა
base = float(input("შეიყვანეთ სამკუთხედის ფუძის სიგრძე: "))
height = float(input("შეიყვანეთ სამკუთხედის სიმაღლე: "))

# ფართობის გამოთვლა: სამკუთხედის ფართობი არის ფუძისა და სიმაღლის ნამრავლის ნახევარი
area = (base * height) / 2

# შედეგის გამოტანა
print(f"სამკუთხედის ფართობი უდრის: {area}")



# 5. კონსოლიდან შეიტანეთ ორნიშნა რიცხვი და დაბეჭდეთ ციფრთა ჯამი.

# კონსოლიდან ორნიშნა რიცხვის შეტანა
number = int(input("შეიყვანეთ ორნიშნა რიცხვი: "))

# დავადგინოთ რიცხვის აბსოლუტური მნიშვნელობა
abs_number = abs(number)

# ციფრების გამოთვლა აბსოლუტური მნიშვნელობიდან
first_digit = abs_number // 10
second_digit = abs_number % 10

# ჯამის გამოთვლა და ბეჭდვა
digit_sum = first_digit + second_digit
print("ციფრთა ჯამი არის:", digit_sum)
